{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block1_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block1_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block1_pool", "strides": [2, 2], "trainable": false, "data_format": "channels_last"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block2_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 128, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block2_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 128, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block2_pool", "strides": [2, 2], "trainable": false, "data_format": "channels_last"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block3_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 256, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block3_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 256, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block3_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 256, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block3_pool", "strides": [2, 2], "trainable": false, "data_format": "channels_last"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block4_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block4_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block4_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block4_pool", "strides": [2, 2], "trainable": false, "data_format": "channels_last"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "name": "block5_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "name": "block5_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "name": "block5_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "padding": "same"}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block5_pool", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "fc6", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "name": "fc6", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "filters": 1024, "activity_regularizer": null, "padding": "valid"}}, {"inbound_nodes": [[["fc6", 0, 0, {}]]], "class_name": "Dropout", "name": "drop1", "config": {"trainable": true, "name": "drop1", "rate": 0.5}}, {"inbound_nodes": [[["drop1", 0, 0, {}]]], "class_name": "Conv2D", "name": "fc7", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "name": "fc7", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "padding": "valid"}}, {"inbound_nodes": [[["fc7", 0, 0, {}]]], "class_name": "Dropout", "name": "drop2", "config": {"trainable": true, "name": "drop2", "rate": 0.5}}, {"inbound_nodes": [[["drop2", 0, 0, {}]]], "class_name": "Conv2D", "name": "logits", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "name": "logits", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "filters": 3, "activity_regularizer": null, "padding": "valid"}}, {"inbound_nodes": [[["logits", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "avgpool", "config": {"pool_size": [7, 7], "padding": "valid", "name": "avgpool", "strides": [7, 7], "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["avgpool", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Activation", "name": "probs", "config": {"trainable": true, "name": "probs", "activation": "softmax"}}], "name": "model_1", "output_layers": [["probs", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.8", "class_name": "Model"}