{"backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 64, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_conv1", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 64, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_conv2", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block1_pool", "padding": "valid", "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_conv1", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_conv2", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block2_pool", "padding": "valid", "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 256, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv1", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 256, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv2", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 256, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv3", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block3_pool", "padding": "valid", "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv1", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv2", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv3", "kernel_regularizer": null, "padding": "same", "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block4_pool", "padding": "valid", "trainable": false, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv1", "kernel_regularizer": null, "padding": "same", "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv2", "kernel_regularizer": null, "padding": "same", "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv3", "kernel_regularizer": null, "padding": "same", "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block5_pool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "fc6", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 1024, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "fc6", "kernel_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "drop1", "config": {"name": "drop1", "trainable": true, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["fc6", 0, 0, {}]]]}, {"name": "fc7", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 512, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "fc7", "kernel_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["drop1", 0, 0, {}]]]}, {"name": "drop2", "config": {"name": "drop2", "trainable": true, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["fc7", 0, 0, {}]]]}, {"name": "logits", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 3, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "logits", "kernel_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["drop2", 0, 0, {}]]]}, {"name": "avgpool", "config": {"strides": [7, 7], "pool_size": [7, 7], "name": "avgpool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["logits", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["avgpool", 0, 0, {}]]]}, {"name": "probs", "config": {"name": "probs", "activation": "softmax", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["probs", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.8"}